## Chicago Public Schools - Progress Report Cards (2011-2012)

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: [https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: [https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true](https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&download=true&cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### Connect to the database

Let us now load the ipython-sql  extension and establish a connection with the database

##### The syntax for connecting to magic sql using sqllite is

  **%sql sqlite://DatabaseName**   
  
where DatabaseName will be your **.db** file

In [1]:
import csv, sqlite3

con = sqlite3.connect("RealWorldData.db")
cur = con.cursor()

In [2]:
# preparing the sql environment
%load_ext sql

In [3]:
# connect to the database
%sql sqlite:///RealWorldData.db

Connecting to 'sqlite:///RealWorldData.db'

### Store the dataset in a Table

##### In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. To analyze the data 
##### using SQL, it first needs to be stored in the database.

##### We will first read the csv files  from the given url  into pandas dataframes

##### Next we will be using the  df.to_sql() function to convert each csv file  to a table in sqlite  with the csv data loaded in it.

In [4]:
import pandas
df = pandas.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv")
df.to_sql("CENSUS_DATA", con, if_exists='replace', index=False,method="multi")

df = pandas.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv")
df.to_sql("CHICAGO_CRIME_DATA", con, if_exists='replace', index=False, method="multi")

df = pandas.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv")
df.to_sql("CHICAGO_PUBLIC_SCHOOLS_DATA", con, if_exists='replace', index=False, method="multi")

566

### Query the database system catalog to retrieve table metadata

##### You can verify that the table creation was successful by retrieving the list of all tables in your schema and checking whether the SCHOOLS table was created

In [5]:
# query to retrieve list of all tables in the database

%sql SELECT name FROM sqlite_master WHERE type='table'

Running query in 'sqlite:///RealWorldData.db'

+-----------------------------+
|             name            |
+-----------------------------+
|         CENSUS_DATA         |
|      CHICAGO_CRIME_DATA     |
| CHICAGO_PUBLIC_SCHOOLS_DATA |
+-----------------------------+

### Query the database system catalog to retrieve column metadata

##### The SCHOOLS table contains a large number of columns. How many columns does this table have?

In [6]:
%%sql 
SELECT count(name) AS Num_of_Columns
FROM PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS_DATA');

Running query in 'sqlite:///RealWorldData.db'

+----------------+
| Num_of_Columns |
+----------------+
|       78       |
+----------------+

##### The CRIME table contains a large number of columns. How many columns does this table have?

In [7]:
%%sql 
SELECT count(name) AS Num_of_Columns 
FROM PRAGMA_TABLE_INFO('CHICAGO_CRIME_DATA');

Running query in 'sqlite:///RealWorldData.db'

+----------------+
| Num_of_Columns |
+----------------+
|       21       |
+----------------+

##### The CENSUS table contains a large number of columns. How many columns does this table have?

In [8]:
%%sql 
SELECT count(name) AS Num_of_Columns 
FROM PRAGMA_TABLE_INFO('CENSUS_DATA');

Running query in 'sqlite:///RealWorldData.db'

+----------------+
| Num_of_Columns |
+----------------+
|       9        |
+----------------+

### PROBLEMS

#### Problem 1

##### How many Elementary Schools are in the dataset?

In [9]:
%%sql 
SELECT COUNT(*) AS Num_Ele_Schools
FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
WHERE "Elementary, Middle, or High School" = "ES"

Running query in 'sqlite:///RealWorldData.db'

+-----------------+
| Num_Ele_Schools |
+-----------------+
|       462       |
+-----------------+

#### Problem 2

##### What is the highest Safety Score?

In [10]:
%%sql 
SELECT MAX(safety_score) AS Max_Safety_Score
FROM CHICAGO_PUBLIC_SCHOOLS_DATA;

Running query in 'sqlite:///RealWorldData.db'

+------------------+
| Max_Safety_Score |
+------------------+
|       99.0       |
+------------------+

#### Problem 3

##### Which schools have highest Safety Score?

In [11]:
%%sql 
SELECT 
    Name_of_School, 
    Safety_Score 
FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
WHERE Safety_Score = (
             SELECT MAX(Safety_Score) 
             FROM CHICAGO_PUBLIC_SCHOOLS_DATA);

Running query in 'sqlite:///RealWorldData.db'

+----------------------------------------------+--------------+
|                NAME_OF_SCHOOL                | SAFETY_SCORE |
+----------------------------------------------+--------------+
|      Abraham Lincoln Elementary School       |     99.0     |
|   Alexander Graham Bell Elementary School    |     99.0     |
| Annie Keller Elementary Gifted Magnet School |     99.0     |
|     Augustus H Burley Elementary School      |     99.0     |
| Edgar Allan Poe Elementary Classical School  |     99.0     |
|         Edgebrook Elementary School          |     99.0     |
|       Ellen Mitchell Elementary School       |     99.0     |
|  James E McDade Elementary Classical School  |     99.0     |
|       James G Blaine Elementary School       |     99.0     |
|     LaSalle Elementary Language Academy      |     99.0     |
+----------------------------------------------+--------------+
Truncated to displaylimit of 10.

#### Problem 4

##### What are the top 10 schools with the highest "Average Student Attendance"?

In [12]:
%%sql 
SELECT 
    name_of_school, 
    average_student_attendance
FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
ORDER BY average_student_attendance DESC 
LIMIT 10;

Running query in 'sqlite:///RealWorldData.db'

+-----------------------------------------------+----------------------------+
|                 NAME_OF_SCHOOL                | AVERAGE_STUDENT_ATTENDANCE |
+-----------------------------------------------+----------------------------+
|     John Charles Haines Elementary School     |           98.40%           |
|          James Ward Elementary School         |           97.80%           |
|  Edgar Allan Poe Elementary Classical School  |           97.60%           |
| Orozco Fine Arts & Sciences Elementary School |           97.60%           |
|        Rachel Carson Elementary School        |           97.60%           |
|  Annie Keller Elementary Gifted Magnet School |           97.50%           |
|   Andrew Jackson Elementary Language Academy  |           97.40%           |
|    Lenart Elementary Regional Gifted Center   |           97.40%           |
|            Disney II Magnet School            |           97.30%           |
|   John H Vanderpoel Elementary Magnet School  |           97.20%           |
+-----------------------------------------------+----------------------------+
Truncated to displaylimit of 10.

#### Problem 5

##### Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [13]:
%%sql 
SELECT 
    name_of_school, 
    REPLACE(Average_Student_Attendance, '%', '') AS Average_Student_Attendance
FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
ORDER BY average_student_attendance NULLS LAST
LIMIT 5;

Running query in 'sqlite:///RealWorldData.db'

+---------------------------------------------------+----------------------------+
|                   NAME_OF_SCHOOL                  | Average_Student_Attendance |
+---------------------------------------------------+----------------------------+
| Richard T Crane Technical Preparatory High School |           57.90            |
|    Barbara Vick Early Childhood & Family Center   |           60.90            |
|                 Dyett High School                 |           62.50            |
|        Wendell Phillips Academy High School       |           63.00            |
|              Orr Academy High School              |           66.30            |
+---------------------------------------------------+----------------------------+

#### Problem 6

##### Which Schools have Average Student Attendance lower than 70%?

In [14]:
%%sql 
SELECT 
    Name_of_School, 
    REPLACE(Average_Student_Attendance, '%', '') AS Average_Student_Attendance  
FROM CHICAGO_PUBLIC_SCHOOLS_DATA 
WHERE CAST (REPLACE(Average_Student_Attendance, '%', '') AS DOUBLE ) < 70 
ORDER BY Average_Student_Attendance

Running query in 'sqlite:///RealWorldData.db'

+---------------------------------------------------+----------------------------+
|                   NAME_OF_SCHOOL                  | Average_Student_Attendance |
+---------------------------------------------------+----------------------------+
| Richard T Crane Technical Preparatory High School |           57.90            |
|    Barbara Vick Early Childhood & Family Center   |           60.90            |
|                 Dyett High School                 |           62.50            |
|        Wendell Phillips Academy High School       |           63.00            |
|              Orr Academy High School              |           66.30            |
|         Manley Career Academy High School         |           66.80            |
|   Chicago Vocational Career Academy High School   |           68.80            |
|   Roberto Clemente Community Academy High School  |           69.60            |
+---------------------------------------------------+----------------------------+

#### Problem 7

##### Get the total College Enrollment for each Community Area

In [15]:
%%sql 
SELECT 
    community_area_name, 
    SUM(College_Enrollment) AS Total_College_Enrollment
FROM CHICAGO_PUBLIC_SCHOOLS_DATA
GROUP BY community_area_name
ORDER BY Total_College_Enrollment DESC
LIMIT 5;

Running query in 'sqlite:///RealWorldData.db'

+---------------------+--------------------------+
| COMMUNITY_AREA_NAME | Total_College_Enrollment |
+---------------------+--------------------------+
|    SOUTH LAWNDALE   |          14793           |
|    BELMONT CRAGIN   |          14386           |
|        AUSTIN       |          10933           |
|      GAGE PARK      |           9915           |
|    BRIGHTON PARK    |           9647           |
+---------------------+--------------------------+

#### Problem 8

##### Get the 5 Community Areas with the least total College Enrollment  sorted in ascending order

In [16]:
%%sql 
SELECT 
    COMMUNITY_AREA_NAME, 
    SUM(College_Enrollment) AS Total_College_Enrollment
FROM CHICAGO_PUBLIC_SCHOOLS_DATA
GROUP BY COMMUNITY_AREA_NAME
ORDER BY Total_College_Enrollment 
LIMIT 5;

Running query in 'sqlite:///RealWorldData.db'

+---------------------+--------------------------+
| COMMUNITY_AREA_NAME | Total_College_Enrollment |
+---------------------+--------------------------+
|       OAKLAND       |           140            |
|     FULLER PARK     |           531            |
|       BURNSIDE      |           549            |
|        OHARE        |           786            |
|         LOOP        |           871            |
+---------------------+--------------------------+

#### Problem 9

##### List 5 schools with lowest safety score

In [17]:
%%sql 
SELECT 
    name_of_school, 
    safety_score 
FROM CHICAGO_PUBLIC_SCHOOLS_DATA  
WHERE safety_score !='None' 
ORDER BY safety_score 
LIMIT 5;

Running query in 'sqlite:///RealWorldData.db'

+----------------------------------------+--------------+
|             NAME_OF_SCHOOL             | SAFETY_SCORE |
+----------------------------------------+--------------+
|     Edmond Burke Elementary School     |     1.0      |
|     Luke O'Toole Elementary School     |     5.0      |
|   George W Tilton Elementary School    |     6.0      |
|     Foster Park Elementary School      |     11.0     |
| Emil G Hirsch Metropolitan High School |     13.0     |
+----------------------------------------+--------------+

#### Problem 10

##### The name of the community area with highest hardship index

In [18]:
%%sql
SELECT community_area_name 
FROM CENSUS_DATA
WHERE HARDSHIP_INDEX = (
    SELECT MAX(hardship_index) 
    FROM CENSUS_DATA);

Running query in 'sqlite:///RealWorldData.db'

+---------------------+
| COMMUNITY_AREA_NAME |
+---------------------+
|      Riverdale      |
+---------------------+

#### Problem 11

##### List all case numbers for crimes involving minors?(children are not considered minors for the purposes of crime analysis)

In [19]:
%%sql
SELECT case_number 
FROM CHICAGO_CRIME_DATA
WHERE description LIKE '%MINOR';

Running query in 'sqlite:///RealWorldData.db'

+-------------+
| CASE_NUMBER |
+-------------+
|   HL266884  |
|   HK238408  |
+-------------+

#### Problem 12

##### List all kidnapping crimes involving a child?

In [20]:
%%sql
SELECT * 
FROM CHICAGO_CRIME_DATA
WHERE primary_type = 'KIDNAPPING'

Running query in 'sqlite:///RealWorldData.db'

+---------+-------------+------------+----------------------+------+--------------+--------------------------+----------------------+--------+----------+------+----------+------+-----------------------+---------+--------------+--------------+------+-------------+--------------+-------------------------------+
|    ID   | CASE_NUMBER |    DATE    |        BLOCK         | IUCR | PRIMARY_TYPE |       DESCRIPTION        | LOCATION_DESCRIPTION | ARREST | DOMESTIC | BEAT | DISTRICT | WARD | COMMUNITY_AREA_NUMBER | FBICODE | X_COORDINATE | Y_COORDINATE | YEAR |   LATITUDE  |  LONGITUDE   |            LOCATION           |
+---------+-------------+------------+----------------------+------+--------------+--------------------------+----------------------+--------+----------+------+----------+------+-----------------------+---------+--------------+--------------+------+-------------+--------------+-------------------------------+
| 5276766 |   HN144152  | 2007-01-26 | 050XX W VAN BUREN ST | 1792 |  KIDNAPPING  | CHILD ABDUCTION/STRANGER |        STREET        |   0    |    0     | 1533 |    15    | 29.0 |          25.0         |    20   |  1143050.0   |  1897546.0   | 2007 | 41.87490841 | -87.75024931 | (41.874908413, -87.750249307) |
+---------+-------------+------------+----------------------+------+--------------+--------------------------+----------------------+--------+----------+------+----------+------+-----------------------+---------+--------------+--------------+------+-------------+--------------+-------------------------------+

#### Problem 13

##### What kinds of crimes were recorded at schools?

In [21]:
%%sql
SELECT DISTINCT(primary_type) 
FROM CHICAGO_CRIME_DATA
WHERE location_description LIKE 'SCHOOL%'

Running query in 'sqlite:///RealWorldData.db'

+------------------------+
|      PRIMARY_TYPE      |
+------------------------+
|        BATTERY         |
|    CRIMINAL DAMAGE     |
|       NARCOTICS        |
|        ASSAULT         |
|   CRIMINAL TRESPASS    |
| PUBLIC PEACE VIOLATION |
+------------------------+

#### Problem 14

##### Which community area is most crime prone?

In [22]:
%%sql
SELECT *
FROM CHICAGO_CRIME_DATA
GROUP BY COMMUNITY_AREA_NUMBER
ORDER BY COUNT(*) DESC LIMIT 1

Running query in 'sqlite:///RealWorldData.db'

+---------+-------------+------------+--------------------+------+--------------+-------------+----------------------+--------+----------+------+----------+------+-----------------------+---------+--------------+--------------+------+-------------+--------------+-------------------------------+
|    ID   | CASE_NUMBER |    DATE    |       BLOCK        | IUCR | PRIMARY_TYPE | DESCRIPTION | LOCATION_DESCRIPTION | ARREST | DOMESTIC | BEAT | DISTRICT | WARD | COMMUNITY_AREA_NUMBER | FBICODE | X_COORDINATE | Y_COORDINATE | YEAR |   LATITUDE  |  LONGITUDE   |            LOCATION           |
+---------+-------------+------------+--------------------+------+--------------+-------------+----------------------+--------+----------+------+----------+------+-----------------------+---------+--------------+--------------+------+-------------+--------------+-------------------------------+
| 9166453 |   HW303994  | 2013-06-04 | 055XX W GLADYS AVE | 810  |    THEFT     |  OVER $500  |   VACANT LOT/LAND    |   0    |    0     | 1522 |    15    | 29.0 |          25.0         |    6    |  1139693.0   |  1897797.0   | 2013 | 41.87565911 | -87.76256886 | (41.875659108, -87.762568861) |
+---------+-------------+------------+--------------------+------+--------------+-------------+----------------------+--------+----------+------+----------+------+-----------------------+---------+--------------+--------------+------+-------------+--------------+-------------------------------+

#### Problem 15

##### Determine the Community Area Name with most number of crimes?

In [23]:
%%sql
SELECT community_area_name 
FROM CENSUS_DATA
WHERE community_area_number IN 
    (SELECT community_area_number
     FROM  CHICAGO_CRIME_DATA
     GROUP BY community_area_number
     ORDER BY COUNT(*) DESC LIMIT 1)

Running query in 'sqlite:///RealWorldData.db'

+---------------------+
| COMMUNITY_AREA_NAME |
+---------------------+
|        Austin       |
+---------------------+

### Author

##### Oluwaseyi Akinsanya